var provinces = [{
  "name": "政治与公共事务管理学院",
  "id": "110000"
}, {
  "name": "法学院",
  "id": "120000"
}, {
  "name": "外语学院",
  "id": "130000"
}, {
  "name": "数学与统计学院",
  "id": "140000"
}, {
  "name": "化学与环境工程学院",
  "id": "150000"
},{
  "name":"英东生命科学学院",
  "id":"160000"
},{
  "name":"英东农业科学与工程学院",
  "id":"170000"
},{
  "name":"英东食品科学与工程学院",
  "id":"180000"
},{
  "name":"美术与设计学院",
  "id":"190000"
},{
  "name":"音乐学院",
  "id":"200000"
},{
  "name":"经济管理学院",
  "id":"210000"
},{
  "name":"旅游与地理学院",
  "id":"220000"
},{
  "name":"体育学院",
  "id":"230000"
},{
  "name":"教育学院",
  "id":"240000"
},{
  "name":"土木工程学院",
  "id":"250000"
},{
  "name":"物理与机电工程学院",
  "id":"260000"
},{
  "name":"信息科学与工程学院",
  "id":"270000"
},{
  "name":"软件学院",
  "id":"280000"
},{
  "name":"医学分院",
  "id":"290000"
},{
  "name":"韶州师范分院",
  "id":"300000"
},{
  "name":"文学院",
  "id":"310000"
}]

var citys = {
  "110000": [
    {
      "province": "政治与公共事务管理学院",
      "name": "公共事业管理",
      "id": "110100"
    },
    {
      "province": "政治与公共事务管理学院",
      "name": "行政管理",
      "id": "110200"
    },
    {
      "province": "政治与公共事务管理学院",
      "name": "历史学",
      "id": "110300"
    }
  ],
  "120000": [
    {
      "province": "法学院",
      "name": "法学",
      "id": "120100"
    },
    {
      "province": "法学院",
      "name": "社会工作",
      "id": "120200"
    }
  ],
  "130000": [
    {
      "province": "外语学院",
      "name": "日语",
      "id": "130100"
    },
    {
      "province": "外语学院",
      "name": "商务英语",
      "id": "130300"
    },
    {
      "province": "外语学院",
      "name": "英语",
      "id": "130400"
    },
    {
      "province": "外语学院",
      "name": "应用日语",
      "id": "130700"
    }
  ],
  "140000": [
    {
      "province": "数学与统计学院",
      "name": "数学与应用数学",
      "id": "140100"
    },
    {
      "province": "数学与统计学院",
      "name": "统计学",
      "id": "140200"
    },
    {
      "province": "数学与统计学院",
      "name": "信息与计算科学",
      "id": "140300"
    },
    {
      "province": "数学与统计学院",
      "name": "应用统计学",
      "id": "140400"
    }
  ],
  "150000": [
    {
      "province": "化学与环境工程学院",
      "name": "化学",
      "id": "150100"
    },
    {
      "province": "化学与环境工程学院",
      "name": "环境工程",
      "id": "150100"
    },
    {
      "province": "化学与环境工程学院",
      "name": "应用化学",
      "id": "150100"
    }
  ],
  "160000": [
    {
      "province": "英东生命科学学院",
      "name": "生物工程",
      "id": "160100"
    },
    {
      "province": "英东生命科学学院",
      "name": "生物科学",
      "id": "160200"
    },
    {
      "province": "英东生命科学学院",
      "name": "生物技术",
      "id": "160300"
    },
    {
      "province": "英东生命科学学院",
      "name": "生物科学类",
      "id": "160300"
    }
  ],
  "170000": [
    {
      "province": "英东农业科学与工程学院",
      "name": "动物科学",
      "id": "150100"
    },
    {
      "province": "英东农业科学与工程学院",
      "name": "园林",
      "id": "150100"
    },
    {
      "province": "英东农业科学与工程学院",
      "name": "园艺",
      "id": "150100"
    },
    {
      "province": "英东农业科学与工程学院",
      "name": "土地资源管理",
      "id": "150100"
    }
  ],
  "180000": [
    {
      "province": "英东食品科学与工程学院",
      "name": "食品科学与工程",
      "id": "180100"
    },
    {
      "province": "英东食品科学与工程学院",
      "name": "食品质量与安全",
      "id": "180200"
    },
    {
      "province": "英东食品科学与工程学院",
      "name": "食品营养与检验教育",
      "id": "180300"
    }
  ],
  "190000": [
    {
      "province": "美术与设计学院",
      "name": "产品设计",
      "id": "190100"
    },
    {
      "province": "美术与设计学院",
      "name": "动画",
      "id": "190200"
    },
    {
      "province": "美术与设计学院",
      "name": "服装与服饰设计",
      "id": "190300"
    },
    {
      "province": "美术与设计学院",
      "name": "环境设计",
      "id": "190400"
    },
    {
      "province": "美术与设计学院",
      "name": "绘画",
      "id": "190500"
    },
    {
      "province": "美术与设计学院",
      "name": "设计学类",
      "id": "190600"
    },
    {
      "province": "美术与设计学院",
      "name": "美术学",
      "id": "190700"
    },
    {
      "province": "美术与设计学院",
      "name": "视觉传达设计",
      "id": "190800"
    }
  ],
  "200000": [
    {
      "province": "音乐学院",
      "name": "舞蹈学",
      "id": "200100"
    },
    {
      "province": "音乐学院",
      "name": "音乐表演",
      "id": "200200"
    },
    {
      "province": "音乐学院",
      "name": "音乐学",
      "id": "200300"
    },
    {
      "province": "音乐学院",
      "name": "音乐与舞蹈学类",
      "id": "200400"
    }
  ],
  "210000": [
    {
      "province": "经济管理学院",
      "name": "工商管理",
      "id": "210100"
    },
    {
      "province": "经济管理学院",
      "name": "国际经济与贸易",
      "id": "210200"
    },
    {
      "province": "经济管理学院",
      "name": "会计学",
      "id": "210300"
    },
    {
      "province": "经济管理学院",
      "name": "会计学(ACCA)",
      "id": "210400"
    },
    {
      "province": "经济管理学院",
      "name": "人力资源管理",
      "id": "210500"
    },
    {
      "province": "经济管理学院",
      "name": "国际商务",
      "id": "210600"
    },
    {
      "province": "经济管理学院",
      "name": "工商管理类",
      "id": "210700"
    }
  ],
  "220000": [
    {
      "province": "旅游与地理学院",
      "name": "地理科学",
      "id": "220100"
    },
    {
      "province": "旅游与地理学院",
      "name": "旅游管理",
      "id": "220200"
    },
    {
      "province": "旅游与地理学院",
      "name": "人文地理与城乡规划",
      "id": "220300"
    }
  ],
  "230000": [
    {
      "province": "体育学院",
      "name": "体育教育",
      "id": "230100"
    },
     {
      "province": "体育学院",
      "name": "社会体育指导与管理",
      "id": "230200"
    }
  ],
  "240000": [
    {
      "province": "教育学院",
      "name": "心理学",
      "id": "240100"
    },
    {
      "province": "教育学院",
      "name": "小学教育",
      "id": "240200"
    },
    {
      "province": "教育学院",
      "name": "教育学",
      "id": "240300"
    },
    {
      "province": "教育学院",
      "name": "数字媒体技术",
      "id": "240400"
    }
  ],
  "250000": [
    {
      "province": "土木工程学院",
      "name": "土木工程",
      "id": "250100"
    },
    {
      "province": "土木工程学院",
      "name": "无机非金属材料工程",
      "id": "250200"
    }
  ],
  "260000": [
    {
      "province": "物理与机电工程学院",
      "name": "车辆工程",
      "id": "260100"
    },
    {
      "province": "物理与机电工程学院",
      "name": "电子信息科学与技术",
      "id": "260200"
    },
    {
      "province": "物理与机电工程学院",
      "name": "机械设计制造及其自动化",
      "id": "260300"
    },
    {
      "province": "物理与机电工程学院",
      "name": "交通运输",
      "id": "260400"
    },
    {
      "province": "物理与机电工程学院",
      "name": "物理学",
      "id": "260500"
    },
    {
      "province": "物理与机电工程学院",
      "name": "自动化",
      "id": "260600"
    }
  ],
  "270000": [
    {
      "province": "信息科学与工程学院",
      "name": "计算机科学与技术",
      "id": "270100"
    },
    {
      "province": "信息科学与工程学院",
      "name": "计算机科学与技术(3+1)",
      "id": "270200"
    },
    {
      "province": "信息科学与工程学院",
      "name": "通信工程",
      "id": "270300"
    },
    {
      "province": "信息科学与工程学院",
      "name": "物联网工程",
      "id": "270400"
    },
    {
      "province": "信息科学与工程学院",
      "name": "信息管理与信息系统",
      "id": "270500"
    },
    {
      "province": "信息科学与工程学院",
      "name": "计算机应用技术",
      "id": "270600"
    },
  ],
  "280000": [
    {
      "province": "软件学院",
      "name": "软件工程",
      "id": "280100"
    }
  ],
  "290000": [
    {
      "province": "医学分院",
      "name": "临床医学",
      "id": "290100"
    },
    {
      "province": "医学分院",
      "name": "护理学",
      "id": "290200"
    }
  ],
  "300000": [
    {
      "province": "韶州师范分院",
      "name": "学前教育",
      "id": "300100"
    },
    {
      "province": "旅游与地理学院",
      "name": "旅游管理",
      "id": "150100"
    },
    {
      "province": "旅游与地理学院",
      "name": "人文地理与城乡规划",
      "id": "150100"
    }
  ],
  "310000": [
    {
      "province": "文学院",
      "name": "汉语言文学",
      "id": "310100"
    },
    {
      "province": "文学院",
      "name": "秘书学",
      "id": "310200"
    },
    {
      "province": "文学院",
      "name": "新闻学",
      "id": "310300"
    }
  ]
}


module.exports = {
  citys,
  provinces,
}