var provinces = [{
  "name": "北区",
  "id": "110000"
}, {
  "name": "南区",
  "id": "120000"
}, {
  "name": "西区",
  "id": "130000"
}, {
  "name": "黄田坝校区",
  "id": "140000"
}, {
  "name": "黎灿楼",
  "id": "150000"
}]

var citys = {
  "110000": [
    {
      "province": "北区",
      "name": "紫藤苑",
      "id": "110100"
    },
    {
      "province": "北区",
      "name": "碧桃苑",
      "id": "110200"
    },
    {
      "province": "北区",
      "name": "丹桂苑",
      "id": "110300"
    }
  ],
  "120000": [
    {
      "province": "南区",
      "name": "丹枫苑",
      "id": "120100"
    },
    {
      "province": "南区",
      "name": "丹竹苑",
      "id": "120200"
    },
    {
      "province": "南区",
      "name": "紫竹苑",
      "id": "120300"
    },
    {
      "province": "南区",
      "name": "碧桂苑",
      "id": "120400"
    },
    {
      "province": "南区",
      "name": "红枫苑",
      "id": "120500"
    },
    {
      "province": "南区",
      "name": "红棉苑",
      "id": "120600"
    },
    {
      "province": "南区",
      "name": "紫荆苑",
      "id": "120700"
    },
    {
      "province": "南区",
      "name": "紫薇苑",
      "id": "120800"
    },
    {
      "province": "南区",
      "name": "银杏苑",
      "id": "120900"
    },
  ],
  "130000": [
    {
      "province": "西区",
      "name": "丁香苑",
      "id": "130100"
    },
    {
      "province": "西区",
      "name": "海棠苑",
      "id": "130200"
    },
    {
      "province": "西区",
      "name": "秋枫苑",
      "id": "130300"
    },
    {
      "province": "西区",
      "name": "蔷薇苑",
      "id": "130400"
    },
    {
      "province": "西区",
      "name": "芙蓉苑",
      "id": "130500"
    }
  ],
  "140000": [
    {
      "province": "黄田坝校区",
      "name": "黄田坝宿舍楼",
      "id": "140100"
    }
  ],
  "150000": [
    {
      "province": "黎灿楼",
      "name": "网园",
      "id": "150100"
    }
  ]
}
var areas = {
  "110100": [
    {
      "city": "紫藤苑",
      "name": "1栋",
      "id": "110101"
    }
  ],
  "110200": [
    {
      "city": "碧桃苑",
      "name": "20栋",
      "id": "110201"
    },
    {
      "city": "碧桃苑",
      "name": "21栋",
      "id": "110202"
    },
    {
      "city": "碧桃苑",
      "name": "24栋",
      "id": "110203"
    },
    {
      "city": "碧桃苑",
      "name": "25栋",
      "id": "110204"
    },
    {
      "city": "碧桃苑",
      "name": "27栋",
      "id": "110205"
    },
    {
      "city": "碧桃苑",
      "name": "28栋",
      "id": "110207"
    },
    {
      "city": "碧桃苑",
      "name": "29栋",
      "id": "110208"
    }
  ],
  "110300": [
    {
      "city": "丹桂苑",
      "name": "22栋",
      "id": "110301"
    },
    {
      "city": "丹桂苑",
      "name": "23栋",
      "id": "110302"
    },
    {
      "city": "丹桂苑",
      "name": "26栋",
      "id": "110303"
    }
  ],
  "120100": [
    {
      "city": "丹枫苑",
      "name": "A栋",
      "id": "120101"
    },
    {
      "city": "丹枫苑",
      "name": "B栋",
      "id": "120102"
    }
  ],
  "120200": [
    {
      "city": "丹竹苑",
      "name": "A栋",
      "id": "120201"
    },
    {
      "city": "丹竹苑",
      "name": "B栋",
      "id": "120202"
    },
    {
      "city": "丹竹苑",
      "name": "C栋",
      "id": "120203"
    }
  ],
  "120300": [
    {
      "city": "紫竹苑",
      "name": "A栋",
      "id": "120301"
    },
    {
      "city": "紫竹苑",
      "name": "B栋",
      "id": "120302"
    }
  ],
  "120400": [
    {
      "city": "碧桂苑",
      "name": "A栋",
      "id": "120401"
    },
    {
      "city": "碧桂苑",
      "name": "B栋",
      "id": "120402"
    },
    {
      "city": "碧桂苑",
      "name": "C栋",
      "id": "120403"
    }
  ],
  "120500": [
    {
      "city": "红枫苑",
      "name": "A栋",
      "id": "120501"
    },
    {
      "city": "红枫苑",
      "name": "B栋",
      "id": "120502"
    }
  ],
  "120600": [
    {
      "city": "红棉苑",
      "name": "东栋",
      "id": "120601"
    },
    {
      "city": "红棉苑",
      "name": "西栋",
      "id": "120602"
    }
  ],
  "120700": [
    {
      "city": "紫荆苑",
      "name": "A栋",
      "id": "120701"
    },
    {
      "city": "紫荆苑",
      "name": "B栋",
      "id": "120702"
    }
  ],
  "120800": [
    {
      "city": "紫薇苑",
      "name": "A栋",
      "id": "120801"
    },
    {
      "city": "紫薇苑",
      "name": "B栋",
      "id": "120802"
    },
    {
      "city": "紫薇苑",
      "name": "C栋",
      "id": "120803"
    }
  ],
  "120900": [
    {
      "city": "银杏苑",
      "name": "A栋",
      "id": "120901"
    },
    {
      "city": "银杏苑",
      "name": "B栋",
      "id": "120902"
    }
  ],
  "130100": [
    {
      "city": "丁香苑",
      "name": "A栋",
      "id": "130101"
    },
    {
      "city": "丁香苑",
      "name": "B栋",
      "id": "130102"
    },
    {
      "city": "丁香苑",
      "name": "C栋",
      "id": "130103"
    },
    {
      "city": "丁香苑",
      "name": "D栋",
      "id": "130105"
    },
    {
      "city": "丁香苑",
      "name": "E栋",
      "id": "130106"
    },
    {
      "city": "丁香苑",
      "name": "F栋",
      "id": "130107"
    },
    {
      "city": "丁香苑",
      "name": "G栋",
      "id": "130108"
    }
  ],
  "130200": [
    {
      "city": "海棠苑",
      "name": "A栋",
      "id": "130201"
    },
    {
      "city": "海棠苑",
      "name": "B栋",
      "id": "130202"
    },
    {
      "city": "海棠苑",
      "name": "C栋",
      "id": "130203"
    }
  ],
  "130300": [
    {
      "city": "秋枫苑",
      "name": "A栋",
      "id": "130301"
    },
    {
      "city": "秋枫苑",
      "name": "B栋",
      "id": "130302"
    },
    {
      "city": "秋枫苑",
      "name": "C栋",
      "id": "130303"
    },
    {
      "city": "秋枫苑",
      "name": "D栋",
      "id": "130304"
    }
  ],
  "130400": [
    {
      "city": "蔷薇苑",
      "name": "A栋",
      "id": "130401"
    },
    {
      "city": "蔷薇苑",
      "name": "B栋",
      "id": "130402"
    },
    {
      "city": "蔷薇苑",
      "name": "C栋",
      "id": "130403"
    }
  ],
  "130500": [
    {
      "city": "芙蓉苑",
      "name": "A栋",
      "id": "130501"
    },
    {
      "city": "芙蓉苑",
      "name": "B栋",
      "id": "130502"
    },
    {
      "city": "芙蓉苑",
      "name": "C栋",
      "id": "130503"
    },
    {
      "city": "芙蓉苑",
      "name": "D栋",
      "id": "130504"
    }
  ],
  "140100": [
    {
      "city": "黄田坝宿舍楼",
      "name": "6栋",
      "id": "140101"
    },
    {
      "city": "黄田坝宿舍楼",
      "name": "9栋",
      "id": "140102"
    },
    {
      "city": "黄田坝宿舍楼",
      "name": "10栋",
      "id": "140103"
    }
  ],
  "150100":[
	{
      "city": "网园",
      "name": "",
      "id": "150101"
    }
  ]
}

module.exports = {
  citys,
  provinces,
  areas
}